# LEET CODE
## Problem-627: Swap Salary
Class: Easy

Source: https://leetcode.com/problems/swap-salary/

## Description
SQL Schema

Table: Salary
| Column Name | Type     |
|-------------|----------|
| id          | int      |
| name        | varchar  |
| sex         | ENUM     |
| salary      | int      |

id is the primary key (column with unique values) for this table.

The sex column is ENUM (category) value of type ('m', 'f').

The table contains information about an employee.

## To Do
Write a solution to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.

Note that you must write a single update statement, do not write any select statement for this problem.

The result format is in the following example.

## Example

Input: 

Salary table:
| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | m   | 2500   |
| 2  | B    | f   | 1500   |
| 3  | C    | m   | 5500   |
| 4  | D    | f   | 500    |

Output: 
| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | f   | 2500   |
| 2  | B    | m   | 1500   |
| 3  | C    | f   | 5500   |
| 4  | D    | m   | 500    |

Explanation: 
- (1, A) and (3, C) were changed from 'm' to 'f'.
- (2, B) and (4, D) were changed from 'f' to 'm'.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = {
    'id': [1, 2, 3, 4],
    'name': ['A', 'B', 'C', 'D'],
    'sex': ['m', 'f', 'm', 'f'],
    'salary': [2500, 1500, 5500, 500]
}

Salary = pd.DataFrame(data)

In [3]:
Salary

   id name sex  salary
0   1    A   m    2500
1   2    B   f    1500
2   3    C   m    5500
3   4    D   f     500

## Task

In [18]:
# Define the SQL query
query = """
SELECT 
    id, 
    name,
    CASE
        WHEN sex = "m" THEN "f"
        ELSE "m"
    END AS sex,
    salary
FROM Salary        
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Salary':Salary})

# Dipslay the results dataframe
display(result)

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500

### Using UPDATE statement

In [17]:
# Define the SQL query
query = """
WITH CTE AS (
    SELECT * FROM Salary
)
UPDATE Salary
SET sex = 
        CASE
            WHEN sex = "m" THEN "f"
            ELSE "m"
        END
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Salary':Salary})

# Dipslay the results dataframe
display(result)

None

### Important Note
- In leet code submission, we don't have to use the CTE Method, but It is nessessary in case of SQL Lite in Panadas.
- The UPDATE Statement, changes the table, so we have to store a copy of it in some other table.